InformationRegisters/SAP_Ограничения.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<InformationRegister>		<InternalInfo>			<xr:GeneratedType name="InformationRegisterRecord.SAP_Ограничения" category="Record">				<xr:TypeId>f41f5f4c-26e5-47be-b2b4-0870cfe89260</xr:TypeId>				<xr:ValueId>e92d5d81-779c-42a4-bd82-e6e0f7c7fc0c</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterManager.SAP_Ограничения" category="Manager">				<xr:TypeId>88e50c4e-0179-444a-84e5-09d7f55aada6</xr:TypeId>				<xr:ValueId>43c64286-7acc-4e83-aea7-62c70129cbfd</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterSelection.SAP_Ограничения" category="Selection">				<xr:TypeId>b8408454-0a46-4560-ae20-f99d40c88ac8</xr:TypeId>				<xr:ValueId>6a6f9762-1188-4da9-883c-cb6bf9510ffe</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterList.SAP_Ограничения" category="List">				<xr:TypeId>fc118ac1-5e40-4f2c-95b4-fc3f5931456b</xr:TypeId>				<xr:ValueId>79221443-443f-43fd-ae64-1a67d6f95032</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordSet.SAP_Ограничения" category="RecordSet">				<xr:TypeId>c8d429b0-8c1a-4cef-8466-e994ab32d552</xr:TypeId>				<xr:ValueId>e14c729d-ccf4-4f84-9ca3-5f134912cd32</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordKey.SAP_Ограничения" category="RecordKey">				<xr:TypeId>a498a412-46fd-4c5b-b320-ba614f3e556c</xr:TypeId>				<xr:ValueId>9de696c1-77e6-4e51-8b8e-a34822708633</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordManager.SAP_Ограничения" category="RecordManager">				<xr:TypeId>0c24f442-804e-4322-8a40-a1eb7b5c0257</xr:TypeId>				<xr:ValueId>1c4041c2-81c3-40fe-afe3-ef7dbef99218</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>SAP_Ограничения</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>SAP ограничения</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<EditType>InDialog</EditType>			<DefaultRecordForm>InformationRegister.SAP_Ограничения.Form.ФормаЗаписи</DefaultRecordForm>			<DefaultListForm/>			<AuxiliaryRecordForm/>			<AuxiliaryListForm/>			<StandardAttributes>				<xr:StandardAttribute name="Active">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="LineNumber">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Recorder">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Period">					<xr:LinkByType/>					<xr:FillChecking>ShowError</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>			</StandardAttributes>			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>			<WriteMode>Independent</WriteMode>			<MainFilterOnPeriod>false</MainFilterOnPeriod>			<IncludeHelpInContents>false</IncludeHelpInContents>			<DataLockControlMode>Managed</DataLockControlMode>			<FullTextSearch>DontUse</FullTextSearch>			<EnableTotalsSliceFirst>false</EnableTotalsSliceFirst>			<EnableTotalsSliceLast>false</EnableTotalsSliceLast>			<RecordPresentation/>			<ExtendedRecordPresentation/>			<ListPresentation/>			<ExtendedListPresentation/>			<Explanation/>			<DataHistory>DontUse</DataHistory>			<UpdateDataHistoryImmediatelyAfterWrite>false</UpdateDataHistoryImmediatelyAfterWrite>			<ExecuteAfterWriteDataHistoryVersionProcessing>false</ExecuteAfterWriteDataHistoryVersionProcessing>		</Properties>		<ChildObjects>			<Resource>				<Properties>					<Name>Доступ</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Доступ</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:EnumRef.SAP_УровниДоступа</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>				</Properties>			</Resource>			<Dimension>				<Properties>					<Name>Пользователь</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Пользователь</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>false</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>true</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>			<Dimension>				<Properties>					<Name>Метаданные</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Метаданные</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>xs:string</v8:Type>						<v8:StringQualifiers>							<v8:Length>150</v8:Length>							<v8:AllowedLength>Variable</v8:AllowedLength>						</v8:StringQualifiers>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>false</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>true</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>			<Dimension>				<Properties>					<Name>Реквизит</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Реквизит</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>xs:string</v8:Type>						<v8:StringQualifiers>							<v8:Length>150</v8:Length>							<v8:AllowedLength>Variable</v8:AllowedLength>						</v8:StringQualifiers>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>false</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>true</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>			<Dimension>				<Properties>					<Name>ТипМетаданных</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Тип метаданных</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>xs:string</v8:Type>						<v8:StringQualifiers>							<v8:Length>150</v8:Length>							<v8:AllowedLength>Variable</v8:AllowedLength>						</v8:StringQualifiers>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>false</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>true</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>			<Form>ФормаЗаписи</Form>		</ChildObjects>	</InformationRegister></MetaDataObject>

InformationRegisters/SAP_Ограничения/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСписокТипМетаданных()
КонецПроцедуры

Процедура ОбновитьСписокТипМетаданных()
	Элементы.ТипМетаданных.СписокВыбора.Добавить("Документы", "Документ", , БиблиотекаКартинок.Документ);
	Элементы.ТипМетаданных.СписокВыбора.Добавить("Справочники", "Справочник", , БиблиотекаКартинок.Справочник);
	Элементы.ТипМетаданных.СписокВыбора.Добавить("РегистрыНакопления", "Регистр накопления", , БиблиотекаКартинок.РегистрНакопления);
	Элементы.ТипМетаданных.СписокВыбора.Добавить("РегистрыСведений", "Регистр сведений", , БиблиотекаКартинок.РегистрСведений);
	Элементы.ТипМетаданных.СписокВыбора.Добавить("Отчеты", "Отчет", , БиблиотекаКартинок.Отчет);
	Элементы.ТипМетаданных.СписокВыбора.Добавить("Обработки", "Обработка", , БиблиотекаКартинок.Обработка);
	Элементы.ТипМетаданных.СписокВыбора.Добавить("РегистрыБухгалтерии", "РегистрБухгалтерии", , БиблиотекаКартинок.РегистрБухгалтерии);
	Элементы.ТипМетаданных.СписокВыбора.Добавить("ОбщиеФормы", "ОбщиеФормы", , БиблиотекаКартинок.Форма);
КонецПроцедуры

&НаСервере
Процедура ТипМетаданныхПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Запись.ТипМетаданных) Тогда
		Элементы.Метаданные.СписокВыбора.Очистить();
		Для каждого Эл Из Метаданные[Запись.ТипМетаданных] Цикл
			Элементы.Метаданные.СписокВыбора.Добавить(Эл.Имя,Эл.Синоним);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипМетаданныхПриИзменении(Элемент)
	ТипМетаданныхПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура МетаданныеПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Запись.Метаданные) Тогда
		Элементы.Реквизит.СписокВыбора.Очистить();
		Для каждого Эл Из Метаданные[Запись.ТипМетаданных][Запись.Метаданные].Реквизиты Цикл
			Элементы.Реквизит.СписокВыбора.Добавить(строка(Эл.Имя),строка(Эл));
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МетаданныеПриИзменении(Элемент)
	МетаданныеПриИзмененииНаСервере();
КонецПроцедуры
